app/controllers/admins/genres_controller.rb

INSERT INTO "genres" ("genre_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["genre_name", "こここここ"], ["created_at", "2019-07-15 06:39:44.320060"], ["updated_at", "2019-07-15 06:39:44.320060"]]
---
  def create
  	@genre = Genre.new(genre_params)
    @genre.save