app/controllers/admins/products_controller.rb

SELECT "genres".* FROM "genres"
---
	def new
	@product = Product.new
	@genres = Genre.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
	def edit
	@product = Product.find(params[:id])
	@genres = Genre.all

INSERT INTO "products" ("genre_id", "artist_name", "cd_title", "label_name", "product_image_id", "price", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
	@product = Product.new(product_params)
	@product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "products" SET "product_image_id" = ?, "buy_capable" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product_image_id", "9eb3dfec98851ec56d87652851ffb6ae93ceb6b226376dd634dff3417451"], ["buy_capable", 0], ["updated_at", "2019-07-15 12:32:02.074359"], ["id", 3]]
---
	def update
	@product = Product.find(params[:id])
	@product.update(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 3]]
---
	def destroy
	@product = Product.find(params[:id])
	@product.destroy