app/controllers/admins/users_controller.rb

  def show
    @user = User.find(params[:id])
    @addresses = Address.where(user_id: user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 2]]