app/views/orders/new.html.erb


  <%= f.collection_select :to_address, Address.where(user_id: current_user.id), :address,:address %><br>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 2]]