app/controllers/addresses_controller.rb

  def edit
    @address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @address = Address.new(address_params)
    @address.user_id = current_user.id
    @address.save
---
INSERT INTO "addresses" ("user_id", "tel_number", "postal_code", "address", "to_name", "to_name_kana", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @address = Address.find(params[:id])
    @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "to_name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "ここggyuguy\r\n"], ["to_name", "ここj"], ["updated_at", "2019-07-14 11:01:03.443201"], ["id", 1]]

  def destroy
    @address = Address.find(params[:id])
    @address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 2]]