app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]
---
  def index
	@carts = Cart.where(user_id: current_user.id)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["product_id", 1], ["created_at", "2019-07-14 10:59:53.930520"], ["updated_at", "2019-07-14 10:59:53.930520"]]
---
  def create
    @product = Product.find(params[:product_id])
    if @product.presence

    else
      @cart = current_user.carts.new(product_id: @product.id)
      @cart.save

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "quantity" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 3], ["updated_at", "2019-07-15 07:32:14.081739"], ["id", 1]]
---
  def update_all
    params.permit!
    params[:cart].keys.each do |id|
    @cart = Cart.find(id.to_i)
    @cart.update_attributes(params[:cart][id])