app/controllers/orders_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 2]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]
---
  def new
    @order = Order.new
    @addresses = Address.where(user_id: current_user.id)
    @carts = Cart.where(user_id: current_user.id)

INSERT INTO "orders" ("payment_method", "to_address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["payment_method", 1], ["to_address", "大阪市"], ["user_id", 2], ["created_at", "2019-07-27 09:12:28.250986"], ["updated_at", "2019-07-27 09:12:28.250986"]]
---
  def create
  @order = Order.new(order_params)
  @order.user_id = current_user.id
  @order.save