app/controllers/order_products_controller.rb

  def new
    @order = Order.find(params[:order_id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]