app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = ?, "first_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "gender" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "藤田"], ["first_name", "弘明"], ["last_name_kana", "フジタ"], ["first_name_kana", "ヒロアキ"], ["gender", 2], ["updated_at", "2019-07-15 07:42:12.055774"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
		@user_id = current_user.id
		if @user.update(user_params)